УТ_для_edt/src/BusinessProcesses/смартIECHOПродажа/смартIECHOПродажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>смартIECHOПродажа</name>
  <comment>//смарт:ММ #092 389 17.01.2021</comment>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.смартIECHOСпецификация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентСогласился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентОтказалсяОтЗаказаНаЭтапеОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

УТ_для_edt/src/InformationRegisters/ИсполнителиЗадач/ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиЗадач</name>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДокументыПодписаны</name>
    <comment>//++ #1650 смарт:Шляпников 17.09.2024 //Отметка &quot;Оригиналы документов получены&quot; (Заказ клиента) при частичной отгрузке (1650)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставке</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитанаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеПоТарифу</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСуммаПоТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовКлиентов</name>
  <enumValues>
    <name>ОжидаетсяСогласование</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяАвансДоОбеспечения</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПредоплатаДоОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОбеспечение</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОплатаПослеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ГотовКЗакрытию</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/BusinessProcesses/смартIECHOПродажа/ObjectModule.bsl
Процедура СогласоватьСКлиентомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Исполнитель = Автор;
	КонецЦикла;
	
	ЗаполнитьСтандартныеРеквизитыНовойЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);

КонецПроцедуры

Процедура СогласоватьСКлиентомОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
	
КонецПроцедуры

Процедура КлиентСогласилсяПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = КлиентСогласился;
	
КонецПроцедуры

Процедура ПометитьСпецификациюНаУдалениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Исполнитель = Автор;
	КонецЦикла;
	
	ЗаполнитьСтандартныеРеквизитыНовойЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	// Проверка, возможно, задачу можно сразу выполнить
	
	Если Предмет.ПометкаУдаления Тогда
		Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
			ФормируемаяЗадача.Выполнена = Истина;
			ФормируемаяЗадача.ДатаИсполнения = ТекущаяДатаСеанса();
			ЭтотОбъект.Завершен = Истина;
			ЭтотОбъект.ДатаЗавершения = ТекущаяДатаСеанса();
			ЭтотОбъект.Записать();
		КонецЦикла;	
	КонецЕсли;
		
КонецПроцедуры

Процедура ПометитьНаУдалениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если НЕ ЭтотОбъект.Завершен Тогда
		ЭтотОбъект.Завершен = Истина;
		ЭтотОбъект.ДатаЗавершения = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьСпецификациюНаУдалениеОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Если НЕ Предмет.ПометкаУдаления Тогда
		ОбщегоНазначения.СообщитьПользователю("Спецификация не помечена на удаление. Задача не выполнена.");
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура КлиентОплатилСчетПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = НЕ КлиентОтказалсяОтЗаказаНаЭтапеОплаты;
	
КонецПроцедуры

Процедура СоздатьНоменклатуруПоСпецификацииПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	УстановитьИсполнителейИзсмартПредопределенногоЗначения(ФормируемыеЗадачи);
	ЗаполнитьСтандартныеРеквизитыНовойЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);

КонецПроцедуры

Процедура СоздатьНоменклатуруПоСпецификацииПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если Предмет.Номенклатура <> Номенклатура Тогда
		УстановитьПривилегированныйРежим(Истина);
		СпецификацияОбъект = Предмет.ПолучитьОбъект();
		СпецификацияОбъект.Номенклатура = Номенклатура;
		СпецификацияОбъект.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьНоменклатуруПоСпецификацииОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указана номенклатура. Задача не выполнена.");
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Исполнитель = Автор;
	КонецЦикла;

	ЗаполнитьСтандартныеРеквизитыНовойЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	//// Проверка, есть ли уже введенный заказ клиента на основании предмета.
	//// Если есть, то задача выполяется автоматически сразу
	//// Если нет, то мониторится, когда будет создан заказ клиента, и тогда задача выполняется программно.
	//// Либо можно вручную указать заказ в форме задачи и выполнить ее
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗаказКлиента.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|ГДЕ
	//|	НЕ ЗаказКлиента.ПометкаУдаления
	//|	И ЗаказКлиента.ДокументОснование = &Предмет";
	//
	//Запрос.УстановитьПараметр("Предмет", Предмет);
	//	
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	
	//	ЗаказКлиента = Выборка.Ссылка;
	//	
	//	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
	//		ФормируемаяЗадача.Выполнена = Истина;
	//		ФормируемаяЗадача.ДатаИсполнения = ТекущаяДатаСеанса();
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаказОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	// Должен быть создан заказ клиента на основании предмета задачи (спецификации)
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не указан заказ клиента. Задача не выполнена.");
		Результат = Ложь;
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ЗаказКлиента.Ссылка КАК Ссылка
		//|ИЗ
		//|	Документ.ЗаказКлиента КАК ЗаказКлиента
		//|ГДЕ
		//|	НЕ ЗаказКлиента.ПометкаУдаления
		//|	И ЗаказКлиента.ДокументОснование = &Предмет";
		//
		//Запрос.УстановитьПараметр("Предмет", Предмет);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//Если РезультатЗапроса.Пустой() Тогда
		//	Результат = Ложь;
		//	ОбщегоНазначения.СообщитьПользователю("Не найден заказ клиента, созданный на основании спецификации. Задача не выполнена.");
		//Иначе
		//	Выборка = РезультатЗапроса.Выбрать();
		//	Выборка.Следующий();
		//	ЗаказКлиента = Выборка.Ссылка;
		//КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОтменитьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Исполнитель = Автор;
	КонецЦикла;
	
	ЗаполнитьСтандартныеРеквизитыНовойЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	// Проверка, возможно, задачу можно выполнить сразу
	
	Если ЗначениеЗаполнено(ЗаказКлиента) И ЗаказКлиента.ПометкаУдаления Тогда		
		
		Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
			ФормируемаяЗадача.Выполнена = Истина;
			ФормируемаяЗадача.ДатаИсполнения = ТекущаяДатаСеанса();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьЗаказОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	// Заказ клиента, созданные на основании спецификации, должен быть помечен на удаление
	Результат = Истина;
	
	Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Результат = ЗаказКлиента.ПометкаУдаления;
		Если НЕ Результат Тогда
			ОбщегоНазначения.СообщитьПользователю("Заказ клиента " + ЗаказКлиента + " не отменен. Задача не выполнена.");
		КонецЕсли;
	Иначе
		Результат = Ложь;
		ОбщегоНазначения.СообщитьПользователю("В задаче не указан заказ клиента");
	КонецЕсли;
		
КонецПроцедуры

Процедура СоздатьЗаказПоставщикуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	УстановитьИсполнителейИзсмартПредопределенногоЗначения(ФормируемыеЗадачи);
	ЗаполнитьСтандартныеРеквизитыНовойЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
КонецПроцедуры

Процедура СоздатьЗаказПоставщикуОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	// Задача считается выполненной, если создан заказ поставщику
	// Автоматически пока не отслеживается и не проверяется
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Результат = Ложь;
		ОбщегоНазначения.СообщитьПользователю("Не указан заказ поставщику. Задача не выполнена.");
	КонецЕсли;

КонецПроцедуры

Процедура ОжиданиеОплатыОтКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Исполнитель = Автор;
	КонецЦикла;
	
	ЗаполнитьСтандартныеРеквизитыНовойЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
КонецПроцедуры

Процедура ОжиданиеОплатыОтКлиентаОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	// Если установлен флаг КлиентОтказалсяОтЗаказаНаЭтапеОплаты, то проверки нет
	// Если не установлен флаг КлиентОтказалсяОтЗаказаНаЭтапеОплаты, то проверить наличие оплаты от клиента
	
	Результат = Истина;
	
	Если КлиентОтказалсяОтЗаказаНаЭтапеОплаты = Ложь Тогда
		
		ЕстьОплатаОтКлиента = ПроверитьНаличиеОплатыОтКлиента();
		Результат = ЕстьОплатаОтКлиента;
		
		Если НЕ Результат Тогда
			ОбщегоНазначения.СообщитьПользователю("По заказу клиента не поступало оплаты. Задача не выполнена.");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры




Процедура УстановитьИсполнителейИзсмартПредопределенногоЗначения(ФормируемыеЗадачи)
	
	СсылкаНаПредопределенноеЗначение = Справочники.смартПредопределенныеЗначения.ПользовательОтветственныйЗаСозданиеНоменклатуры;
	смартОтветственныйЗаСозданиеНоменклатуры = Справочники.РолиИсполнителей.смартОтветственныйЗаСозданиеНоменклатуры;
	
	// Заполнить РС ИсполнителиЗадач актуальными значениями из предопределенных настроек смарт
	
	// 1. Сравнить пользователей из смарт предопределенных и регистра ИсполнителиЗадач
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВТ_ИсполнителиВРегистре
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|ГДЕ
	|	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ИсполнителиПредопределенные
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	НЕ смартПредопределенныеЗначения.СписокЗначений
	|	И смартПредопределенныеЗначения.Ссылка = &СсылкаПредопределеннаяНастройка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений
	|	И смартПредопределенныеЗначенияЗначения.Ссылка = &СсылкаПредопределеннаяНастройка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ_ИсполнителиВРегистре.Исполнитель, """") КАК ИзРегистра,
	|	ЕСТЬNULL(ВТ_ИсполнителиПредопределенные.Значение, """") КАК ИзСправочника
	|ИЗ
	|	ВТ_ИсполнителиВРегистре КАК ВТ_ИсполнителиВРегистре
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ИсполнителиПредопределенные КАК ВТ_ИсполнителиПредопределенные
	|		ПО ВТ_ИсполнителиВРегистре.Исполнитель = ВТ_ИсполнителиПредопределенные.Значение
	|ГДЕ
	|	(ВТ_ИсполнителиВРегистре.Исполнитель ЕСТЬ NULL
	|			ИЛИ ВТ_ИсполнителиПредопределенные.Значение ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("РольИсполнителя", смартОтветственныйЗаСозданиеНоменклатуры);
	Запрос.УстановитьПараметр("СсылкаПредопределеннаяНастройка", СсылкаНаПредопределенноеЗначение);
	
	Результат = Запрос.Выполнить();
	
	ЕстьОтличия = НЕ Результат.Пустой();
	
	Если ЕстьОтличия Тогда
		
		МассивПользователей = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СсылкаНаПредопределенноеЗначение, Истина);

		//// 1. Удаление старых записей для роли смартОтветственныйЗаСозданиеНоменклатуры
		//	
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
		//|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
		//|ИЗ
		//|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		//|ГДЕ
		//|	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя";
		//
		//Запрос.УстановитьПараметр("РольИсполнителя", смартОтветственныйЗаСозданиеНоменклатуры);
		//
		//Выборка = Запрос.Выполнить().Выбрать();
		//
		//Пока Выборка.Следующий() Цикл
		//	
		//	НаборЗаписей = РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
		//	НаборЗаписей.Отбор.РольИсполнителя.Установить(Выборка.РольИсполнителя);
		//	НаборЗаписей.Отбор.Исполнитель.Установить(Выборка.Исполнитель);
		//	
		//	НаборЗаписей.Прочитать();		
		//	НаборЗаписей.Очистить();
		//	НаборЗаписей.Записать();
		//	
		//КонецЦикла;
		
		// 2. Добавление новых записей
		
		Если МассивПользователей.Количество() > 0 Тогда
			
			НаборЗаписей = РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.РольИсполнителя.Установить(смартОтветственныйЗаСозданиеНоменклатуры);

			Для Каждого ТекПользователь Из МассивПользователей Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.РольИсполнителя = смартОтветственныйЗаСозданиеНоменклатуры;
				НоваяЗапись.Исполнитель = ТекПользователь;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
		
	//Если МассивПользователей.Количество() > 0 Тогда
	//	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
	//		//ФормируемаяЗадача.Исполнитель = МассивПользователей[0];
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтандартныеРеквизитыНовойЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Автор = Автор;
		ФормируемаяЗадача.Предмет = Предмет;
		ФормируемаяЗадача.Описание = ОписаниеТочки(ТочкаМаршрутаБизнесПроцесса);
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеТочки(ТочкаМаршрутаБизнесПроцесса) Экспорт

	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СогласоватьСКлиентом Тогда
		Возврат "Укажите, согласился клиент или нет, и нажмите ""Выполнено""";			
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ПометитьСпецификациюНаУдаление Тогда
		Возврат "Пометьте спецификацию на удаление";
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьНоменклатуруПоСпецификации Тогда
		Возврат "Создайте номенклатуру по спецификации и укажите ее в задаче";
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьЗаказ Тогда
		Возврат "Создайте заказ клиента на основании спецификации";
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОжиданиеОплатыОтКлиента Тогда
		Возврат "Ожидание оплаты от клиента. 
		|Задача автоматически выполнится при поступлении оплаты, либо пометке заказа клиента на удаление. 
		|Также можно вручную указать, что клиент отказалася от заказа на этапе оплаты.";	
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОтменитьЗаказ Тогда
		Возврат "Отмените заказ клиента, созданный на основании спецификации";
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьЗаказПоставщику Тогда
		Возврат "Создайте заказ поставщику";
	КонецЕсли;

КонецФункции

Функция ПроверитьНаличиеОплатыОтКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияЗаказовКлиентов.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &Заказ
	|	И ВЫБОР
	|			КОГДА СостоянияЗаказовКлиентов.ПроцентОплаты > 0
	|				ТОГДА ИСТИНА
	|			КОГДА СостоянияЗаказовКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКОбеспечению)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции
